{
  "dishes": [
    {
      "name": "Brown Rice Pulao",
      "type": "Veg",
      "ingredients": "2 large onion\n2 large tomatoes\n1/2 cup peas\n5-6 cloves garlic\n1/2 cup cauliflower\n1.75 cups brown rice (raw)\n5-6 cups water three times of rice\n2 tsp desi ghee\n1 small bay leaf\n1 big black cardamom optional\n2 tsp red chilli powder\n2 tsp haldi powder\n1 tsp Garm Masala\n2 tsp Jeera\nsalt as per taste\\n",
      "description": "1. Gather all the veggies and brown rice. Soak brown rice in warm/hot water for about 40 min. Wash vegetables under running water.\n2. Chop veggies as you like it in small or large chunks.\n3. Take pressure cooker and add 2 tsp desi ghee. Add bay leaf, black cardamom. I was short for other spices, you may add cloves, black pepper etc. Once its aromatic, add Jeera. As it splutters, add Chopped garlic. (you may grate it even)\n4. Add onions. Once they are transparent add green chilly and tomatoes.\n5. Add spices like red chilly, haldi and garm masala. Add salt and vegetables like cauliflower, beans, carrots.\n6. Mix well and add peas.. Make sure to remove the rice from water in which they were soaked.\n7. Add water to rice in the ratio 3:1. So , one portion of rice and three portion of water. Add more salt and mix well.\n8. Put the lid on and give a pressure of 2 whistles on full. Simmer for 15 min. dont release the pressure. Let it cool off itself and open 15 min after it cools off.\n9. The Veg Brown Rice Pulao are ready. Serve with your choice of chutney, Papad and dahi!",
      "image": "pulao.jpg"
    },
    {
      "name": "Brown Rice Onion Pilaf",
      "type": "Veg",
      "ingredients": "20 ml oil\n1 Tbsp butter\n1 onion, sliced\n1 bay leaf\n1/2 tsp cinnamon powder\n1 pinch sugar\n1 1/2 cup brown basamati rice, washed and soaked\n3- 3 1/2 cups vegetables stock/ chicken stock/ plain water\nSalt, to taste\nPepper, to taste\n",
      "description": "1. In a deep pan add oil and butter.\n2. Add the sliced onions and saute till translucent.\n3. Add the bay leaf, cinnamon and sugar. Saute till brown and caramelized.\n4. Add the soaked rice, salt and pepper. Saute.\n5. Add the stock.\n6. Cover and cook till done.\n7. Serving suggestion: Serve with garlic balsamic prawns.\n8. Note: Brown rice requires more water for cooking as compared to white rice.\n",
      "image": "pilaf.jpg"
    },
    {
      "name": "Mushroom Brown Rice",
      "type": "Veg",
      "ingredients": "1 cup brown basmati rice,washed\n9-10 mushrooms,washed and sliced\n1 onion, chopped\n1/2 cup butter (you can reduce the amount if you want to or you can use 2 Tbsp olive oil)\n1 green capsicum\n1 tsp black pepper\nSalt, to taste\n2 cups water\n",
      "description": "1.Wash the brown rice with water.\n2.Cut the mushrooms, onions and capsicum.\n3.In a pan add butter/olive oil and add onions. Saute till pink.\n4.Add mushrooms. Saute till they wilt.\n5.Now add the capsicum. Saute and add the pre-washed brown rice. Saute for 5-7 minutes.\n6.Add salt, pepper and 2 cups water.\n7.Cook for 15 minutes or till the rice are done.\n",
      "image": "mushroom.jpg"
    },
    {
      "name": "Risotto-e-Tonno",
      "type": "Non-Veg",
      "ingredients": "300 gms arborio rice\n1 litre vegetable stock\n50 gms unsalted butter\n50 gms onions, finely chopped\n10 gms garlic, chopped\nto taste salt\nto taste black pepper\n75 gms parmesan cheese\n",
      "description": "1.In a medium saucepan, melt 2 tablespoons of the butter over medium heat.\n2.Add the onion and garlic and cook for about 5 minutes, stirring with a wooden spoon, until the onion is transparent, for about 5 minutes.\n3.Add the rice and cook, stirring, until it is well coated with the butter and starts to turn translucent, for 2 minutes.\n4.Ladle 1/2 cup of the warm stock into the rice mixture and simmer, stirring occasionally, until the broth is absorbed.\n5.Repeat, adding 1/2 cup of broth at a time, until the rice is cooked through but still firm.\n6.Add the remaining butter and the salt, pepper, and parmesan. Stir to incorporate. Adjust seasoning with more salt to taste.\n7.Serve immediately.\n",
      "image": "risotto.jpg"
    },
    {
      "name": "Chicken Schezwan Brown Rice",
      "type": "Non-Veg",
      "ingredients": ""
    }
  ]
}